[
    {
        "id": 1,
        "name": "GitHub",
        "image": "assets/SVG/github-icon.svg",
        "text": "GitHub is a web-based hosting service for version control using Git. It helps developers store and manage their code, as well as track and control changes to it.",
        "link": "https://github.com/",
        "clicked": false
    },
    {
        "id": 2,
        "name": "Git",
        "image": "assets/SVG/git-icon.svg",
        "text": "Git is a distributed version-control system for tracking changes in source code during software development. It is designed for coordinating work among programmers, but it can be used to track changes in any set of files. Its goals include speed, data integrity, and support for distributed, non-linear workflows.",
        "link": "https://git-scm.com/",
        "clicked": false
    },
    {
        "id": 3,
        "name": "HTML 5",
        "image": "assets/SVG/html-5.svg",
        "text": "Hypertext Markup Language (HTML) is the standard markup language for creating web pages and web applications. HTML can embed programs written in a scripting language such as JavaScript, which affects the behavior and content of web pages. Inclusion of CSS defines the look and layout of content.",
        "link": "https://developer.mozilla.org/en-US/docs/Web/HTML",
        "clicked": false
    },
    {
        "id": 4,
        "name": "CSS 3",
        "image": "assets/SVG/css-3.svg",
        "text": "Cascading Style Sheets (CSS) is a style sheet language used for describing the presentation of a document written in a markup language like HTML. CSS is designed to enable the separation of presentation and content, including layout, colors, and fonts.",
        "link": "",
        "clicked": false
    },
    {
        "id": 5,
        "name": "Bootstrap",
        "image": "assets/SVG/bootstrap.svg",
        "text": "Bootstrap is a giant collection of handy, reusable bits of code written in HTML, CSS, and JavaScript. It’s also a front-end development framework that enables developers & designers to quickly build fully responsive websites.",
        "link": "https://getbootstrap.com/",
        "clicked": false
    },
    {
        "id": 6,
        "name": "JavaScript",
        "image": "assets/SVG/javascript.svg",
        "text": "JavaScript is a prototype-based, multi-paradigm scripting language that is dynamic, and supports object-oriented, imperative, and functional programming styles. JavaScript runs on the client side of the web, which can be used to design or program how the web pages behave on the occurrence of an event.",
        "link": "https://developer.mozilla.org/en-US/docs/Web/JavaScript",
        "clicked": false
    },
    {
        "id": 7,
        "name": "jQuery",
        "image": "assets/SVG/jquery.svg",
        "text": "jQuery is a fast, small, and feature-rich JavaScript library. It makes things like HTML document traversal and manipulation, event handling, animation, and Ajax much simpler with an easy-to-use API that works across a multitude of browsers.",
        "link": "https://jquery.com/",
        "clicked": false
    },
    {
        "id": 8,
        "name": "Firebase",
        "image": "assets/SVG/firebase.svg",
        "text": "Firebase is a technology that allows you to make web applications with no server-side programming so that development turns out to be quicker and easier. With Firebase, you don't need to stress over provisioning servers or building REST APIs; with just a little bit of configuration, you can allow Firebase to store data, verify users and implement access rules.",
        "link": "https://firebase.google.com/",
        "clicked": false
    },
    {
        "id": 9,
        "name": "Node.js",
        "image": "assets/SVG/nodejs-icon.svg",
        "text": "Node.js is an open-source, cross-platform JavaScript run-time environment that executes JavaScript code outside of a browser. Node.js represents a 'JavaScript everywhere' paradigm, unifying web application development around a single programming language, rather than different languages for server side and client side scripts.",
        "link": "https://nodejs.org/",
        "clicked": false
    },
    {
        "id": 10,
        "name": "MySQL",
        "image": "assets/SVG/mysql.svg",
        "text": "MySQL is an open source relational database management system that runs as a server providing multi-user access to a number of databases. It is based on the structure query language (SQL), which is used for adding, removing, and modifying information in the database.",
        "link": "https://www.mysql.com/",
        "clicked": false
    },
    {
        "id": 11,
        "name": "Express",
        "image": "assets/SVG/express.svg",
        "text": "Express is a minimal and flexible Node.js web application framework that provides a robust set of features for web and mobile applications. Express basically helps you manage everything, from routes to handling requests and views.",
        "link": "https://expressjs.com/",
        "clicked": false
    },
    {
        "id": 12,
        "name": "Handlebars",
        "image": "assets/SVG/handlebars.svg",
        "text": "Handlebars.js is a popular templating engine that is powerful, simple to use and has a large community. It is based on the Mustache template language, but improves it in several important ways. With Handlebars, you can separate the generation of HTML from the rest of your JavaScript and write cleaner code.",
        "link": "https://handlebarsjs.com/",
        "clicked": false
    },
    {
        "id": 13,
        "name": "Sequelize",
        "image": "assets/SVG/sequelize.svg",
        "text": "Sequelize is a promise-based ORM for Node.js. Sequelize is easy to learn and has dozens of cool features like synchronization, association, validation, etc. It also has support for PostgreSQL, MySQL, MariaDB, SQLite, and MSSQL.",
        "link": "http://docs.sequelizejs.com/",
        "clicked": false
    },
    {
        "id": 14,
        "name": "MongoDB",
        "image": "assets/SVG/mongodb.svg",
        "text": "MongoDB is a document database with the scalability and flexibility that you want with the querying and indexing that you need. MongoDB stores data in flexible, JSON-like documents, meaning fields can vary from document to document and data structure can be changed over time.",
        "link": "https://www.mongodb.com/",
        "clicked": false
    },
    {
        "id": 15,
        "name": "WordPress",
        "image": "assets/SVG/wordpress-icon.svg",
        "text": "WordPress is an online, open source website creation tool written in PHP. It’s probably the easiest and most powerful blogging and website content management system (or CMS) in existence today.",
        "link": "https://wordpress.org/",
        "clicked": false
    },
    {
        "id": 16,
        "name": "React",
        "image": "assets/SVG/react.svg",
        "text": "React is a JavaScript library for building user interfaces. React makes it painless to create interactive UIs. Design simple views for each state in your application, and React will efficiently update and render just the right components when your data changes.",
        "link": "https://reactjs.org/",
        "clicked": false
    }
]